package theory

/*

идентификация - процесс распознавания пользователя по его
 идентификатору, однозначно определяющий пользователя в системе

аутентификация - процедура проверки подлинности, например проверка
    пароля в базе данных

авторизация - предоставление пользователю или группе лиц прав, на определенные действия в системе

Примеры:

Идентификация
    - запрос логина и проверка существования
Аутентификация
    - запрос пароля и проверка его подлинности
    - запрос еще и смс - двухфакторная аутентификация
Авторизация
    - предоставление пользователю права читать письма/отправлять письма и т.д.

Аутентификация - проверка, что пользователь это тот, кем он о себе заявляет
Авторизация - предоставление доступа либо отказ

*/

